INSERT INTO faculty (name) VALUES
    ('юридический'),
    ('технический'),
    ('экономический');
    
INSERT INTO chair (name, faculty_id) VALUES
    ('права', 1),
    ('программирования', 2),
    ('электроники', 2),
    ('финансов', 3),
    ('учета и аудита', 3);

INSERT INTO classroom (number, capacity, faculty_id) VALUES
    ('301', 50, 1),
    ('302', 100, 1),
    ('лаборатория 201', 30, 2),
    ('202', 100, 2),
    ('101', 50, 3),
    ('102', 100, 3);

INSERT INTO groups (name, faculty_id) VALUES
    ('ЮР-1', 1),
    ('КИБЕР-1', 2),
    ('КИБЕР-2', 2),
    ('ЭЛК-1', 2),
    ('ФИН-1', 3),
    ('БУХ-1', 3);

INSERT INTO student (name, group_id) VALUES
    ('Реджи', 1), 
    ('Алексис', 1),
    ('Карла', 1),
    ('Найджел', 1),
    ('Джоан', 2),
    ('Тара', 2),
    ('Пол', 2),
    ('Джейми', 2),
    ('Грег', 2),
    ('Ден', 2),
    ('Патрик', 3),
    ('Свен', 3),
    ('Арон', 3),
    ('Рос', 3),
    ('Майк', 3),
    ('Лора', 4),
    ('Ребекка', 4),
    ('Пенелопа', 4),
    ('Мария', 4),
    ('Курт', 4),
    ('Джейми', 4),
    ('Кристина', 4),
    ('Каролина', 5),
    ('Рене', 5),
    ('Александра', 5),
    ('Вероника', 5),
    ('Мишель', 6),
    ('Андреас', 6),
    ('Михаэль', 6);

INSERT INTO course (name, chair_id) VALUES
    ('конституционное право', 1), 
    ('криминальное право', 1),
    ('информатика', 2),
    ('кибернетика', 2),
    ('физика', 3),
    ('радиотехника', 3),
    ('сопромат', 3),
    ('математика', 4),
    ('статистика', 4),
    ('деньги и кредит', 4),
    ('экономическая теория', 5),
    ('бухгалтерский учет', 5),
    ('аудит', 5);

INSERT INTO teacher (name, chair_id) VALUES
    ('Салливан', 1), 
    ('Фергюсон', 1),
    ('Фиоре', 1),
    ('Мур', 2),
    ('Эверетт', 2),
    ('Болдуин', 2),
    ('Сингх', 3),
    ('Гамильтон', 3),
    ('Симонс', 4),
    ('Сидвел', 4),
    ('Винтер', 4),
    ('Бергман', 5),
    ('Фитцджеральд', 5);
 
INSERT INTO course_teacher (course_id, teacher_id) VALUES
    (1, 1),
    (1, 3),
    (2, 2),
    (2, 3),
    (3, 5),
    (3, 6),
    (4, 4),
    (4, 5),
    (4, 6),
    (5, 8),
    (6, 7),
    (7, 8),
    (8, 9),
    (8, 10),
    (9, 9),
    (9, 10),
    (10, 11),
    (11, 13),
    (12, 12),
    (13, 12);
   
INSERT INTO lesson (teacher_id, group_id, classroom_id, course_id, dateTime) VALUES
    (1, 1, 2, 2, '2018-11-05 09:00:00'),
    (3, 1, 1, 1, '2018-11-05 12:00:00'),
    (5, 2, 3, 4, '2018-11-05 09:00:00'),
    (5, 3, 3, 4, '2018-11-05 12:00:00'),
    (4, 2, 4, 4, '2018-11-06 09:00:00'),
    (6, 2, 4, 3, '2018-11-06 14:00:00'),
    (10, 5, 5, 8, '2018-11-05 14:00:00'),
    (10, 5, 6, 9, '2018-11-06 09:00:00'),
    (13, 6, 6, 11, '2018-11-06 09:00:00'),
    (12, 6, 6, 12, '2018-11-07 12:00:00');
    
